# Task 1. Написати програму, яка конвертує градуси у радіани (або навпаки, за бажанням, але вкажіть що саме обрали!). 180 градусів - це Pi радіан.
# Взідні дані:
# градуси (або радіани).
# На виході:
# конвертована величина (градуси або радіани) округлена до 5 цифр після коми

import math
x = float(input('Введите радианы x = '))
y = round((x * 180 / math.pi ), 5)
print(y)

# Task 2. Написати програму, що рахує абонплату за комунальним лічильника (наприклад, електроенергії або газу).
#
# Вхідні дані:
# попередні показання
# теперішні показання
# тариф.
# На виході:
# скільки потрібно сплатити, округлено до двох цифр після коми

# Task 3. Написати програму, що рахує податок від надхождення на рахунок підприємця.
#
# Вхідні дані:
# розмір надходження
# відсоток податка
# На виході:
# скільки потрібно сплатити податку
# скільки залишиться чистого прибутку
# (обидва значення округлені до двох цифр після коми)
gross_operating_result = float(input('Введіть розмір надходження = '))
per_tax = float(input('Введіть відсоток податка = '))
tax = round((gross_operating_result * per_tax / 100),2)
net_result_after_taxation = round((gross_operating_result - tax),2)
print(tax)
print(net_result_after_taxation)
print (tax, net_result_after_taxation)

# Task 4. Написати програму що рахує витрати на паливо.
#
# Вхідні дані:
# витрачання палива автомобілем за 100км
# сьогоднішня ціна 1 л палива
# скільки кілометрів треба здолати
# На виході:
# скільки грошей на це піде, округлено до двох цифр після коми
consumption = float(input('Введіть витрачання палива автомобілем за 100км = '))
price = float(input('Введіть ціна 1 л палива = '))
distance = float(input('Введіть скільки кілометрів треба здолати = '))
expenses = round((consumption / 100 * price * distance ),2)
print(expenses)




