"""
II. Написати програму що видаляє те що написано в дужках (), залишивши весь інший текст.
Наприклад з "Я не знав куди йти (втім недивно), тому пішов..."
вийде "Я не знав куди йти, тому пішов...".
Теж саме для текстів з декількома дужками!
Тобто програма-скорочувач для тих кто читає тільки головний контент, а не те що уточнюють в дужках :)
Якщо немає пари дужок, то на виході та ж сама строка без змін.
Вхідні дані:
строка
На виході
така ж строка, але видалено всі дужки та те що між ними
"""
import re
# регулярний вираз r"\([^()]*\)" для знаходження всіх входжень тексту у дужках
pattern = r"\([^()]*\)"

while True:
    text = input("Введіть звернення: ")  # Користувач вводить текст
    # перевірка що текст не пустий
    if text != '':
        try:
            # регулярний вираз для знаходження всіх входжень тексту у дужках і замінює їх на порожні рядки
            cleaned_text = re.sub(pattern, "", text)
            print(cleaned_text)
        except Exception:
            print('Строка не повинна бути пустою')
        break
    else:
        print('Строка не повинна бути пустою')
