"""
Написати функцію-генератор послідовності чисел Фібоначчі.
Функція приймає один параметр - кінцевий індекс елементу до якого треба генерувати числа
за правилами послідовності Фібоначчі.
Написати код що демонструє можливості цієї функції. При використанні генератора повинна бути така послідовність:
"""


def fibonacci_generator(n):
    n0, n1 = 0, 1
    for _ in range(n + 1):
        yield n0
        n0, n1 = n1, n0 + n1


if __name__ == '__main__':
    fib = fibonacci_generator(8)
    for i in fib:
        print(i)
